experiments/opengauss/huawei7/validation/model_calibration_20260824/sysbench-default-vs-recommended-20260826/recommended-r1.sysbench.log
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 6516.71 qps: 105418.89 (r/w/o: 92264.73/0.00/13154.16) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 7296.19 qps: 116680.96 (r/w/o: 102090.58/0.00/14590.37) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 7184.26 qps: 114990.16 (r/w/o: 100619.64/0.00/14370.52) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 7075.71 qps: 113226.30 (r/w/o: 99073.89/0.00/14152.41) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 7648.52 qps: 122467.37 (r/w/o: 107171.32/0.00/15296.05) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 7525.71 qps: 120352.49 (r/w/o: 105299.07/0.00/15053.42) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 7337.96 qps: 117356.34 (r/w/o: 102680.41/0.00/14675.93) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 7170.92 qps: 114809.66 (r/w/o: 100467.82/0.00/14341.83) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 8033.64 qps: 128798.18 (r/w/o: 112728.90/0.00/16069.27) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 8214.54 qps: 131150.69 (r/w/o: 114722.60/0.00/16428.09) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 128 tps: 8166.61 qps: 130613.77 (r/w/o: 114280.55/0.00/16333.22) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 7989.79 qps: 127903.60 (r/w/o: 111925.03/0.00/15978.57) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 128 tps: 7865.54 qps: 125806.71 (r/w/o: 110073.62/0.00/15733.09) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 128 tps: 7585.79 qps: 121503.54 (r/w/o: 106334.95/0.00/15168.59) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 7430.15 qps: 118791.33 (r/w/o: 103933.03/0.00/14858.30) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 128 tps: 7329.27 qps: 117307.31 (r/w/o: 102645.77/0.00/14661.54) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 128 tps: 8219.86 qps: 131433.73 (r/w/o: 115000.01/0.00/16433.72) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 8230.31 qps: 131621.97 (r/w/o: 115158.35/0.00/16463.62) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 128 tps: 8161.87 qps: 130789.93 (r/w/o: 114459.19/0.00/16330.74) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 7998.14 qps: 127964.30 (r/w/o: 111971.01/0.00/15993.29) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 7954.13 qps: 127161.08 (r/w/o: 111254.82/0.00/15906.25) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 128 tps: 7698.94 qps: 122981.00 (r/w/o: 107582.11/0.00/15398.89) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 128 tps: 7477.32 qps: 120006.24 (r/w/o: 105051.60/0.00/14954.63) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 7385.48 qps: 117943.80 (r/w/o: 103172.83/0.00/14770.97) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 128 tps: 8208.93 qps: 131386.93 (r/w/o: 114974.06/0.00/16412.87) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 128 tps: 8213.11 qps: 131436.79 (r/w/o: 115008.57/0.00/16428.22) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 8248.88 qps: 131880.96 (r/w/o: 115387.21/0.00/16493.75) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 128 tps: 8056.22 qps: 129077.35 (r/w/o: 112961.90/0.00/16115.44) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 128 tps: 7809.28 qps: 124925.37 (r/w/o: 109305.82/0.00/15619.55) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 7703.17 qps: 123239.78 (r/w/o: 107837.43/0.00/15402.35) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 128 tps: 7491.06 qps: 119817.91 (r/w/o: 104829.80/0.00/14988.11) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 128 tps: 7261.92 qps: 116226.67 (r/w/o: 101705.84/0.00/14520.83) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 128 tps: 8243.78 qps: 131882.54 (r/w/o: 115389.98/0.00/16492.56) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 128 tps: 8282.47 qps: 132584.56 (r/w/o: 116015.62/0.00/16568.94) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 128 tps: 8179.40 qps: 130845.45 (r/w/o: 114489.65/0.00/16355.81) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 128 tps: 8096.92 qps: 129455.66 (r/w/o: 113265.82/0.00/16189.83) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 128 tps: 7936.79 qps: 126944.57 (r/w/o: 111075.00/0.00/15869.57) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 128 tps: 7667.43 qps: 122876.86 (r/w/o: 107535.00/0.00/15341.86) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 128 tps: 7483.97 qps: 119650.63 (r/w/o: 104684.69/0.00/14965.94) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 7326.86 qps: 117111.69 (r/w/o: 102459.96/0.00/14651.73) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 128 tps: 8178.75 qps: 131153.52 (r/w/o: 114791.04/0.00/16362.48) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 128 tps: 8260.64 qps: 132148.25 (r/w/o: 115624.97/0.00/16523.29) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 128 tps: 8299.22 qps: 132569.32 (r/w/o: 115973.89/0.00/16595.43) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 128 tps: 7987.65 qps: 127877.34 (r/w/o: 111900.04/0.00/15977.30) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 128 tps: 7940.16 qps: 127119.70 (r/w/o: 111238.37/0.00/15881.33) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 128 tps: 7739.65 qps: 123760.46 (r/w/o: 108286.15/0.00/15474.31) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 128 tps: 7534.10 qps: 120398.64 (r/w/o: 105330.43/0.00/15068.21) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 128 tps: 7282.06 qps: 116561.92 (r/w/o: 102001.80/0.00/14560.11) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 128 tps: 8116.55 qps: 130162.67 (r/w/o: 113921.57/0.00/16241.10) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 8223.30 qps: 131272.63 (r/w/o: 114833.04/0.00/16439.59) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 128 tps: 8282.55 qps: 132607.76 (r/w/o: 116036.66/0.00/16571.10) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 128 tps: 8132.21 qps: 130060.24 (r/w/o: 113800.84/0.00/16259.41) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 128 tps: 7995.66 qps: 127948.52 (r/w/o: 111959.21/0.00/15989.32) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 128 tps: 7752.80 qps: 124056.76 (r/w/o: 108552.17/0.00/15504.60) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 128 tps: 7470.15 qps: 119605.49 (r/w/o: 104658.18/0.00/14947.31) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 128 tps: 7278.61 qps: 116320.69 (r/w/o: 101764.48/0.00/14556.21) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 128 tps: 8073.02 qps: 129395.22 (r/w/o: 113247.18/0.00/16148.04) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 128 tps: 8284.97 qps: 132422.42 (r/w/o: 115856.49/0.00/16565.94) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 128 tps: 8228.09 qps: 131556.46 (r/w/o: 115098.28/0.00/16458.18) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 8137.33 qps: 130654.39 (r/w/o: 114374.73/0.00/16279.66) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 128 tps: 7836.64 qps: 125071.55 (r/w/o: 109408.25/0.00/15663.29) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 128 tps: 7802.40 qps: 124681.55 (r/w/o: 109071.74/0.00/15609.81) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 128 tps: 7512.88 qps: 120175.00 (r/w/o: 105156.25/0.00/15018.75) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 128 tps: 7347.05 qps: 117564.86 (r/w/o: 102865.75/0.00/14699.11) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 128 tps: 8134.21 qps: 130341.34 (r/w/o: 114076.91/0.00/16264.42) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 128 tps: 8243.61 qps: 131824.86 (r/w/o: 115343.63/0.00/16481.23) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 128 tps: 8163.43 qps: 130724.78 (r/w/o: 114388.93/0.00/16335.85) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 128 tps: 8239.97 qps: 131725.51 (r/w/o: 115239.56/0.00/16485.95) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 128 tps: 7710.62 qps: 123293.95 (r/w/o: 107874.70/0.00/15419.24) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 7756.29 qps: 124191.53 (r/w/o: 108686.95/0.00/15504.58) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 128 tps: 7529.68 qps: 120449.93 (r/w/o: 105389.56/0.00/15060.37) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 128 tps: 7360.30 qps: 117675.77 (r/w/o: 102949.18/0.00/14726.59) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 128 tps: 7982.87 qps: 127996.12 (r/w/o: 112028.38/0.00/15967.74) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 128 tps: 8189.39 qps: 131046.20 (r/w/o: 114667.43/0.00/16378.78) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 128 tps: 7993.51 qps: 127683.26 (r/w/o: 111695.23/0.00/15988.03) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 128 tps: 7871.62 qps: 126002.88 (r/w/o: 110264.64/0.00/15738.24) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 128 tps: 7719.94 qps: 123431.04 (r/w/o: 107991.17/0.00/15439.88) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 128 tps: 7490.68 qps: 119842.87 (r/w/o: 104860.51/0.00/14982.36) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 128 tps: 7381.60 qps: 118244.58 (r/w/o: 103480.38/0.00/14764.20) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 8305.98 qps: 132785.75 (r/w/o: 116172.78/0.00/16612.97) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8758638
        write:                           0
        other:                           1251234
        total:                           10009872
    transactions:                        625617 (7816.49 per sec.)
    queries:                             10009872 (125063.85 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          80.0368s
    total number of events:              625617

Latency (ms):
         min:                                    1.67
         avg:                                   16.37
         max:                                   76.89
         95th percentile:                       20.37
         sum:                             10240260.42

Threads fairness:
    events (avg/stddev):           4887.6328/57.60
    execution time (avg/stddev):   80.0020/0.01